const projects = [
    // 🔘⚪️🟢🟡⚫️🟣🟠🔴🔵🟤🔺🔻🔸🔳🔷🔶🔹🔲▪️▫️◾️🟥◻️◼️◽️🟧🟨🟩🟦🟫⬜️🟪🟪♦️💬

    // مشروع السياحة
    {
        id: "Tourism-project",
        title: "نظام توصية سياحي قائم على الذكاء الاصطناعي🎓✈️",
        category: "powerbi python",
        tools: ["Python", "Power BI"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/pics/UiUx_Tourism.png",
        shortDescription: "",
        fullDescription:
            `
            نظام توصية سياحي عبر الويب يقدم اقتراحات وجهات مخصصة باستخدام الذكاء الاصطناعي، مصممة وفق تفضيلات المستخدم مثل شخصية السفر، الموضوعات المفضلة، الكلمات المفتاحية، والميزانية.
        
            🔹 <a href="https://deemaessam.github.io/project-ar.html?id=tourism-dataset" target="_blank" style="color:#4CAF50;font-weight:bold;">تفاصيل بناء وتنظيف الداتاسيت</a>
        
            🔹 الميزات الرئيسية:
            🔺 إدارة المستخدم: التسجيل وتسجيل الدخول وتتبع الجلسة لتجربة مخصصة.
            🔺 التوصيات المبنية على الشخصية: بناءً على إجابات المستخدم (الموضوع، نمط السفر، الميزانية والكلمات المفتاحية)، يتم تعيين شخصية سفر
                  (مثل الباحث عن المغامرة، المستكشف الثقافي) واقتراح وجهات تناسب هذه الشخصية.
            🔺 المطابقة بالذكاء الاصطناعي: يتم حساب التشابه الكوني بين كلمات المستخدم وعمود البيانات (الوصف + التقييمات) لتصفية وترتيب الوجهات ذات الصلة.
            🔺 واجهة تفاعلية: تصميم ويب نظيف مع بطاقات وجهات ديناميكية لتسهيل الاستكشاف.
            🔺 تكامل قاعدة البيانات: MySQL لتخزين معلومات المستخدم وبيانات الشخصية، مما يسمح بالتحديثات والتوصيات المخصصة المستمرة.
        
            🔹 التقنيات المستخدمة:
            🔺 بايثون (Flask) للباك إند ومنطق الذكاء الاصطناعي
            🔺 Pandas لمعالجة البيانات وحساب التشابه
            🔺 MySQL لتخزين البيانات
            🔺 HTML وCSS وBootstrap وJinja2 للواجهة الأمامية والقوالب
        
            هذا المشروع يوضح تطبيق كامل يجمع بين رؤى الذكاء الاصطناعي والتخصيص المبني على الشخصية، مقدماً توصيات سفر مخصصة وتجربة واجهة تفاعلية.
        
        `,
        date: "Jun 4, 2025",
        github: ""
    },

    {
        id: "education-platform",
        title: "منصة التعليم الإلكتروني",
        category: "web",
        tools: ["Python", "Flask", "MySQL", "HTML", "CSS", "Bootstrap", "JavaScript"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/pics/education%20platform.png",
        shortDescription:
            "منصة تعليم إلكتروني لإدارة الدورات والمحتوى التعليمي والاختبارات، مع نظام صلاحيات متكامل للمستخدمين.",
        fullDescription:
            `
            منصة تعليم إلكتروني متكاملة تم تطويرها لإدارة الدورات التعليمية والمحتوى والاختبارات من خلال نظام موحد للمعلمين والطلاب.
    
            يركز المشروع على توفير بيئة منظمة لإدارة المحتوى التعليمي، مع ربط الواجهة الأمامية بالخادم وقاعدة البيانات لتوفير تجربة متكاملة لإدارة وعرض الدورات.
    
            أبرز المساهمات في المشروع:
    
            🔺 تطوير تطبيق ويب باستخدام Python وFlask يربط بين واجهة المستخدم والخادم وقاعدة البيانات.
    
            🔺 تصميم وإدارة قاعدة بيانات MySQL لتخزين بيانات المستخدمين والدورات والأقسام والمحتوى والاختبارات والأسئلة والخيارات.
    
            🔺 تطوير نظام لإدارة الدورات التعليمية يتيح إضافة الدورات والأقسام وتنظيم المحتوى داخل كل دورة.
    
            🔺 تطوير وظائف لإضافة وتعديل وحذف المحتوى التعليمي، بما في ذلك محتوى الفيديو والمواد التعليمية.
    
            🔺 بناء نظام اختبارات يتيح إنشاء الاختبارات وإضافة الأسئلة والخيارات وإدارتها ضمن الدورات التعليمية.
    
            🔺 تطبيق نظام تسجيل الدخول والصلاحيات للتحكم في الوظائف والصفحات المتاحة لكل نوع من المستخدمين.
    
            🔺 ربط عمليات إدارة المحتوى مباشرة بقاعدة البيانات لضمان حفظ البيانات وتحديثها بشكل منظم.
    
            🔺 تطوير واجهة مستخدم باستخدام HTML وCSS وBootstrap وJavaScript لتوفير تجربة استخدام واضحة ومتجاوبة.
    
            🔺 تطبيق ممارسات أمنية تشمل تشفير كلمات المرور، إدارة الجلسات، حماية النماذج، والتحقق من الملفات والبيانات المدخلة.
    
            🔺 إضافة آلية لتسجيل العمليات والأنشطة المهمة داخل النظام بهدف تحسين المتابعة والأمان.
    
            ساهم المشروع في بناء نظام متكامل يجمع بين إدارة المحتوى التعليمي، الاختبارات، المستخدمين، وقاعدة البيانات ضمن منصة واحدة قابلة للتوسع.
            `,
        date: "Jul 2026",
        github: "YOUR_GITHUB_LINK"
    },

    {
        id: "ataa-kpi-dashboard",
        title: "منصة إدارة بيانات المستفيدين وتحليل مؤشرات الأداء",
        category: "web",
        tools: ["Python", "Flask", "MySQL", "Pandas", "HTML", "CSS", "JavaScript"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/AtaaPdashboard.jpeg",
        shortDescription:
            "منصة متكاملة لإدارة بيانات المستفيدين وتحليلها وعرض مؤشرات الأداء بشكل لحظي.",
    
        fullDescription:
            `
        كجزء من عملي التطوعي كمحللة تقارير ومؤشرات أداء (KPI Analyst) في جمعية عطاء ♿،
    
        قمت بتصميم وتطوير منصة متكاملة لإدارة البيانات وتحليلها لدعم خدمات المستفيدين وعمليات إعداد التقارير داخل الجمعية.
    
        شمل المشروع دورة حياة البيانات بالكامل، بدءًا من جمع البيانات ومعالجتها، مرورًا بتخزينها وتحليلها، وانتهاءً بعرضها في لوحات معلومات تفاعلية.
    
        أبرز المساهمات:
    
        🔺 تنفيذ عمليات معالجة البيانات بشكل متكامل، بما في ذلك تنظيف البيانات، ومعالجة القيم المفقودة، والتحقق من صحة السجلات، وتوحيد تنسيقات البيانات لضمان الجودة والاتساق.
    
        🔺 بناء خطوط معالجة بيانات (ETL) مؤتمتة باستخدام Python ومكتبة Pandas لاستخراج بيانات المستفيدين وتحويلها وتحميلها بكفاءة.
    
        🔺 تطوير تطبيق ويب متكامل باستخدام Flask يتيح للمستخدمين رفع ملفات CSV وExcel، ومعالجتها تلقائيًا، ثم تخزينها داخل قاعدة البيانات بصورة منظمة.
    
        🔹 <a href="https://deemaessam.github.io/projects/Ataa/index.html" target="_blank" style="color:#4CAF50;font-weight:bold;">معاينة لوحة المعلومات</a>
    
        🔺 تصميم وتنفيذ قاعدة بيانات MySQL لإدارة بيانات المستفيدين، مع دعم عمليات الاستعلام وإعداد التقارير بكفاءة.
    
        🔺 إنشاء لوحات معلومات تفاعلية لعرض مؤشرات الأداء الرئيسية (KPIs)، وإحصائيات المستفيدين، والتوزيع الديموغرافي، والمؤشرات التشغيلية.
    
        🔺 تنفيذ مزامنة لحظية بين قاعدة البيانات ولوحة المعلومات لضمان انعكاس أي بيانات جديدة أو تحديثات مباشرةً في التقارير والرسوم البيانية.
    
        🔺 ربط الواجهة الأمامية مع الخلفية البرمجية لتوفير سير عمل متكامل يشمل رفع البيانات، ومعالجتها، وتخزينها، وتحليلها.
    
        🔺 دعم اتخاذ القرار المبني على البيانات من خلال توفير رؤى دقيقة حول الأداء، وإعداد تقارير آلية، وإتاحة وصول مركزي إلى بيانات الجمعية.
    
        ساهمت هذه المنصة في تحسين كفاءة إعداد التقارير، وتقليل الجهد اليدوي في معالجة البيانات، وتمكين أصحاب المصلحة من متابعة أداء الجمعية من خلال التحليلات اللحظية ومؤشرات الأداء.
        `,
    
        date: "مايو 2026 - حتى الآن",
        github: "YOUR_GITHUB_LINK"
    },

    // تحليل العملاء والمبيعات
    {
        id: "customer-sales-analysis",
        title: "تحليل العملاء والمبيعات لمتجر إلكتروني",
        category: "powerbi python",
        tools: ["Python", "Power BI"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/pics/Customer%20%26%20Sales%20Analysis%20for%20an%20Online%20Store.png",
        shortDescription: "لوحات تفاعلية لتحليل العملاء وأداء المبيعات والاتجاهات الزمنية.",
        fullDescription: `
            قمت ببناء تقرير تحليلي يتضمن عدة لوحات، كل واحدة مصممة للإجابة عن أسئلة عمل مختلفة ودعم اتخاذ القرارات المبنية على البيانات.

            🔹 اللوحة 1 – تحليل العملاء: تحليل سلوك العملاء، التوزيع حسب الجنس والموقع، وقيمة إنفاق العملاء.

            🔹 اللوحة 2 – تحليل المبيعات: فحص أداء المبيعات الكلي، الفئات والمنتجات الأكثر أداءً، وتأثير الخصومات على المبيعات.

            🔹 اللوحة 3 – تحليل السلاسل الزمنية: استكشاف اتجاهات المبيعات عبر الزمن وتحديد الأنماط الموسمية لدعم التنبؤ بالمبيعات المستقبلية.

            🔍 أدوات التصفية التفاعلية: التاريخ · الموقع · الجنس

            هذه الأدوات تتيح للمستخدمين تحليل البيانات من عدة وجهات ومقارنة الأداء بسهولة عبر الفترات والمناطق وشرائح العملاء.
    `,
        date: "Jan 4, 2026",
        github: ""
    },

    // بناء مجموعة بيانات سياحية
    {
        id: "tourism-dataset",
        title: "بناء مجموعة بيانات عالية الجودة لتحليلات السياحة",
        category: "powerbi python",
        tools: ["Python", "Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/tourism.png?raw=true",
        shortDescription:
            "قمت بإنشاء مجموعة بيانات نظيفة ومنظمة لتحليلات السياحة.",
        fullDescription:
            `
            هدف هذا المشروع هو إنشاء مجموعة بيانات شاملة وعالية الجودة لدعم أي مشروع سياحي، وليس فقط أنظمة التوصية.

            خطة المشروع والمساهمات:

            🔹 البحث واختيار الخصائص: مراجعة الأوراق العلمية لتحديد الخصائص الرئيسية لتحليلات السياحة.

            🔹 جمع البيانات: جمع البيانات من الإنترنت ومن مصادر موثوقة، بما في ذلك TripAdvisor وGoogle Maps واثنين من مجموعات بيانات Kaggle
            (وجهات الترفيه في المملكة العربية السعودية والمقاهي في الرياض).

            🔹 دمج البيانات: دمج المصادر المتعددة لتجميع معلومات تفصيلية عن أكثر من 20,000 وجهة سياحية، بما في ذلك:
            🔺 الأسماء، الوصف، التقييمات، والتعليقات
            🔺 الإحداثيات الجغرافية والعناوين
            🔺 الروابط والمواقع الرسمية
            🔺 انطباعات الزوار عبر تقييمات النصوص وتحليل المشاعر
            🔺 الخصائص مثل أنماط السفر (عائلي، فردي) والمدن/المناطق

            🔹 معالجة البيانات:
            🔺 إزالة التكرارات: إزالة الإدخالات المكررة لنفس الوجهة من مصادر مختلفة.
            🔺 التوحيد: توحيد أسماء الوجهات وفئات الموضوعات وصيغ المواقع لضمان الاتساق.
            🔺 إزالة الضوضاء: حذف البيانات غير ذات الصلة والرموز الخاصة والنصوص الافتراضية.
            🔺 معالجة القيم المفقودة: ملء أو إزالة الإدخالات غير المكتملة لضمان موثوقية البيانات.
            🔺 الترجمة: تحويل الإدخالات غير الإنجليزية إلى الإنجليزية للاتساق.
            🔺 استخراج الخصائص: إضافة خصائص مشتقة مثل درجات المشاعر من التعليقات، مؤشرات أنماط السفر، وترميز رقمي للفئات لتسهيل التحليل.

            🔹 التصوير والرؤى: تقليل الموضوعات، إزالة التكرارات، وتصور البيانات لاكتشاف الأنماط والاتجاهات والرؤى العملية لأصحاب المصلحة في السياحة.

            توفر هذه المجموعة قاعدة موثوقة لمشاريع تحليلات السياحة، أنظمة التوصية، تحليل المشاعر، والتخطيط الاستراتيجي.
            `,
        date: "Jun 2, 2025",
        github: "https://github.com/DeemaEssam"
    },

    // خيركم
    {
        id: "Khayrkom",
        title: "تحليل بيانات تعليم القرآن – جمعية خيركم",
        category: "powerbi",
        tools: ["Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/خيركم.png?raw=true",
        shortDescription:
            "لوحات Power BI لتحليل بيانات برامج تعليم القرآن.",
        fullDescription:
            "صممت لوحات تفاعلية باستخدام Power BI لتحليل بيانات برامج تعليم القرآن وتحديد نقاط القوة وفرص التحسين لجمعية خيركم.",
        date: "Dec 2025",
        github: ""
    },

    // يسُر
    {
        id: "Yusur",
        title: "تحليل بيانات المستفيدين – جمعية يسُر",
        category: "powerbi",
        tools: ["Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/تحليل%20بيانات%20مستفيدين%20مركز%20الحياة%20المطمئنة%202025م.jpg?raw=tru",
        shortDescription:
            "لوحات تفاعلية لتحليل بيانات المستفيدين.",
        fullDescription:
            `
            كجزء من عملي التطوعي كمساعد إداري ومحلل بيانات في جمعية يسُر لتنمية الأسرة – مركز الحياة المطمئنة 🤍،

            طورت لوحة تفاعلية باستخدام Power BI كجزء من المهام التشغيلية، بهدف تحويل البيانات الخام إلى مؤشرات واضحة تدعم التخطيط الإداري والمتابعة.

        تتيح اللوحة:

        🔹 تحليل التغيرات الشهرية في عدد المستفيدين وطلبات الاستشارات الأسرية

        🔹 فهم توزيع المستفيدين حسب الجنس (ذكر/أنثى)

        🔹 تحليل أنواع الاستشارات الأسرية الأكثر طلباً
        
        🔹 قياس أثر المبادرات من خلال عدد المستفيدين لكل مبادرة

        ساهم هذا الأداة في تسهيل اتخاذ القرار، تحسين المتابعة، وتحديد الاحتياج الفعلي للخدمات بناءً على البيانات.
            
            `,
        date: "Dec 2025",
        github: ""
    },

    // سَخاء
    {
        id: "sakhaa-performance",
        title: "تحليل الأداء السنوي – جمعية سَخاء",
        category: "powerbi",
        tools: ["Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/%D8%B3%D8%AE%D8%A7.png?raw=true",
        shortDescription:
            "لوحة الأداء السنوي لجمعية سَخاء.",
        fullDescription:
            `
            تطوعت مع جمعية سَخاء عبر منصة التطوع الوطنية في فرصة تحليل بيانات ضمن قسم التسويق.

            خلال هذه التجربة، عملت على:

            🔹 استلام بيانات الأعمال والإنجاز السنوية للجمعية.

            🔹 تنظيم وتحليل البيانات لتكون جاهزة للعرض.

            🔹 تصميم لوحة تفاعلية باستخدام Excel لتسليط الضوء بصرياً على جهود الجمعية ومؤشرات الأداء الرئيسية.

            كانت تجربة قيمة عززت مهاراتي في تحويل البيانات إلى رؤى عملية ودعم اتخاذ القرار بطريقة بسيطة وفعالة.
`,
        date: "Sep 2025",
        github: ""
    },
    // العقارات
    {
        id: "real-estate-riyadh",
        title: "العقارات في الرياض",
        category: "powerbi python web",
        tools: ["Python", "Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/Riyadh_Realestate.png?raw=true",
        shortDescription:
            "تحليل وتصور بيانات سوق العقارات في الرياض.",
        fullDescription:
            "مشروع تحليل سوق العقارات يركز على الاتجاهات والأسعار والرؤى في الرياض باستخدام Python للتحليل وPower BI للتصور.",
        date: "Apr 27, 2024",
        github: ""
    },

    // تحليل بيانات المبيعات
    {
        id: "sales-data-analysis",
        title: "تحليل بيانات المبيعات",
        category: "powerbi",
        tools: ["Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/sales.png?raw=true",
        shortDescription:
            "تصور أداء المبيعات باستخدام Power BI.",
        fullDescription:
            "لوحة Power BI تعرض أداء المبيعات، سلوك العملاء، واتجاهات المنتجات لدعم القرارات المبنية على البيانات.",
        date: "Apr 27, 2024",
        github: ""
    },

    // تحليل بيانات IMDb
    {
        id: "imdb-eda",
        title: "تحليل استكشافي لتقييمات أفلام IMDb",
        category: "powerbi python",
        tools: ["Python", "Power BI"],
        image: "https://github.com/DeemaEssam/DeemaEssam.github.io/blob/main/pics/movies.png?raw=true",
        shortDescription:
            "تحليل استكشافي لبيانات تقييمات أفلام IMDb.",
        fullDescription:
            `
            أجريت تحليل استكشافي للبيانات (EDA) لتقييمات أفلام IMDb لفهم تفضيلات المستخدمين. 
            🔺 تضمن المشروع تنظيف البيانات ومعالجتها باستخدام Python، تليه تصورات البيانات في Power BI لتقديم الرؤى بشكل فعال.
            `,
        date: "Aug 28, 2025",
        github: "https://github.com/DeemaEssam"
    },

    // تصنيف أمراض الغدة الدرقية
    {
        id: "thyroid-disease",
        title: "تصنيف أمراض الغدة الدرقية باستخدام الشبكات العصبية",
        category: "python ml",
        tools: ["Python"],
        image: "https://deemaessam.github.io/pics/thyroid.png",
        shortDescription:
            "نموذج تعلم آلي لتصنيف أمراض الغدة الدرقية.",
        fullDescription:
            "قمت ببناء وتقييم نماذج شبكات عصبية لتصنيف أمراض الغدة الدرقية استناداً إلى البيانات السريرية باستخدام Python.",
        date: "Apr 28, 2024",
        github: ""
    },

    // موقع قائمة الطعام
    {
        id: "menu-website",
        title: "موقع قائمة الطعام",
        category: "web",
        tools: ["HTML", "CSS", "JavaScript", "PHP"],
        image: "https://deemaessam.github.io/pics/pizza.gif",
        shortDescription:
            "موقع قائمة طعام لمطعم مع ميزات التقييم.",
        fullDescription:
            `
            🔺 صممت وطورت الموقع مع قاعدة بيانات تحتوي على جداول للمستخدمين والرسائل.
            🔺 تنفيذ وظائف CRUD (إنشاء، قراءة، تحديث، حذف) لإدارة بيانات العملاء والرسائل.
            🔺 إدارة أذونات المستخدمين، بحيث يمكن للمسؤولين فقط حذف البيانات.
            `,
        date: "Dec 18, 2022",
        github: ""
    },

    // لعبة الأرقام
    {
        id: "numbers-game",
        title: "لعبة الأرقام",
        category: "web",
        tools: ["HTML", "CSS", "JavaScript"],
        image: "https://deemaessam.github.io/pics/game.gif",
        shortDescription:
            "لعبة تعليمية لتعلم الأرقام باللغة الألمانية.",
        fullDescription:
            `لعبة تعليمية تم تطويرها لمساعدة المتعلمين على ممارسة الأرقام كجزء من دورة تعلم اللغة الألمانية.
    
    🔹 <a href="https://gger.netlify.app/index.html" target="_blank" style="color:#4CAF50;font-weight:bold;">جرب اللعبة</a>
    `,
        date: "Apr 19, 2023",
        github: ""
    },

    // نادي الكتب
    {
        id: "book-club",
        title: "نادي الكتب",
        category: "cpp",
        tools: ["C++"],
        image: "https://deemaessam.github.io/pics/book.png",
        shortDescription:
            "برنامج لإدارة نادي الكتب.",
        fullDescription:
            "برنامج C++ مصمم لإدارة أعضاء نادي الكتب والكتب وأنشطة الاستعارة.",
        date: "May 16, 2022",
        github: ""
    },

    // نظام إدارة المتجر
    {
        id: "store-system",
        title: "نظام إدارة المتجر",
        category: "python",
        tools: ["Python"],
        image: "https://deemaessam.github.io/pics/storee.png",
        shortDescription:
            "نظام بسيط لإدارة المتجر.",
        fullDescription:
            "برنامج Python لإدارة مخزون المتجر مع عمليات CRUD الأساسية.",
        date: "Apr 1, 2021",
        github: ""
    },

    // متتبع الأبحاث
    {
        id: "research-tracker",
        title: "متتبع الأبحاث",
        category: "python web",
        tools: ["Python"],
        image: "https://deemaessam.github.io/pics/presentation.gif",
        shortDescription:
            "موقع للبحث وتصدير نتائج الأبحاث.",
        fullDescription:
            `
            🔺 طورت أداة Python لتتبع الأبحاث الأكاديمية وتحليل منشورات المؤلفين على Google Scholar.
            🔺 قمت بتطوير واجهة ويب متكاملة مربوطة بـ Flask لتمكين المستخدمين من استكشاف أعمال الباحثين وتصدير النتائج بصيغة Excel.
            🔺 تنفيذ المنطق الخلفي(Bachend) لجلب وتنظيم وتصدير البيانات بكفاءة لضمان تجربة مستخدم سلسة.
            🔺 دمج سكربتات Python مع APIs في Flask لمعالجة البيانات واسترجاعها في الوقت الفعلي.
            `,
        date: "May 16, 2022",
        github: ""
    },

    // نظام التبرع بالدم
    {
        id: "blood-donation",
        title: "نظام التبرع بالدم",
        category: "sql",
        tools: ["SQL"],
        image: "https://deemaessam.github.io/pics/mainform1.jpeg",
        shortDescription:
            "نظام قاعدة بيانات للتبرع بالدم.",
        fullDescription:
            "قمت بتصميم نظام قاعدة بيانات لإدارة التبرعات بالدم مع ميزات تسجيل الدخول والتسجيل.",
        date: "May 16, 2022",
        github: ""
    },

    // طرق عددية في MATLAB
    {
        id: "Numerical-Methods-Equation",
        title: "طرق عددية لحل المعادلات",
        category: "matlab",
        tools: ["MATLAB"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/pics/matlab.png",
        shortDescription:
            "تنفيذ ومقارنة ثلاث طرق عددية لحل المعادلات في MATLAB: طريقة أويلر، طريقة تايلور، وطريقة رانج-كوتا",
        fullDescription:
            `
            ركز المشروع على تنفيذ ومقارنة ثلاث طرق عددية لحل المعادلات في MATLAB: طريقة أويلر، طريقة تايلور، وطريقة رانج-كوتا. هذه الطرق تستخدم في التطبيقات العلمية والهندسية عندما لا تكون الحلول التحليلية سهلة. باستخدام هذه التقنيات العددية، نسعى لتقريب حلول المعادلات وتحليل دقة وكفاءة كل طريقة.
            `,
        date: "May, 2023",
        github: ""
    },

    // AI دردشة صوتية
    {
        id: "ai-chatvoice",
        title: "دردشة صوتية بالذكاء الاصطناعي",
        category: "python flask",
        tools: ["PYTHON"],
        image: "https://raw.githubusercontent.com/DeemaEssam/DeemaEssam.github.io/refs/heads/main/pics/AiChatVoice.png",
        shortDescription:
            "تطبيق دردشة صوتية يدمج التعرف على الكلام والتحويل الصوتي مع واجهة ويب.",
        fullDescription:
            `
            AIChatVoice هو تطبيق دردشة يدمج التعرف على الكلام والتحويل الصوتي مع واجهة ويب. تم بناؤه باستخدام Node.js وExpress وOpenAI API، ويوفر تجربة تفاعلية بتحويل الكلام إلى نص واستجابة صوتية. يشمل التطبيق ميزة اختيار اللغة بين الإنجليزية والعربية وتسجيل المحادثات في قاعدة بيانات MySQL عبر سكربت PHP.

            الميزات
            🔹 التعرف على الكلام: تحويل الكلام إلى نص.
            🔹 التحويل الصوتي: قراءة استجابات الذكاء الاصطناعي بالصوت.
            🔹 اختيار اللغة: يتيح اختيار الإنجليزية أو العربية.
            🔹 تكامل قاعدة البيانات: حفظ المحادثات واستجابات الذكاء الاصطناعي في MySQL.
            🔹 واجهة ويب: توفير واجهة سهلة للتفاعل مع الدردشة.
            `,
        date: "Jul, 2024",
        github: ""
    }
];


